Revit 2026 API

# RebarTrimExtendData Properties

---

The RebarTrimExtendData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

RebarTrimExtendData Class

Autodesk.Revit.DB.Structure Namespace